#include <stdio.h>

int main() {

	printf("물리학과 주전공에 융합소프트웨어 복수전공 하고있습니다.\n");
	printf("전 대학에서는 컴퓨터공학 전공하였고, 편입생으로 19년도에 서강대에 입학하여 19년도 편입학생회 부회장직을 수행하였습니다.\n"); 
	printf("서강대에서 들은 컴퓨터공학 및 융합소프트웨어 과목으로는 자료구조, JAVA언어, 데이터베이스, 인터넷프로그래밍 및 응용을 수강하였습니다.\n");
	printf("컴퓨팅사고력은 다음학기에 수강할 계획입니다.\n");
	printf("관심있어하는 분야는 application(android) 개발에 관심이 많아 하이브리드 언어 flutter 로 다트 언어 사용해보았고, 안드로이드 용으로 java를 주로 사용하여 앱개발 진행하여 앱 출시 해보았습니다.\n");
	printf("융합소프트웨어 복수전공을 진행하면서 고급응용C프로그래밍을 수강하게끔 되어있기에 처음 듣게 되었고, java에서 file입출력에 대해서 배운점, 자료구조를 수강하였다는 점에서 C언어로 프로그래밍 하는것이 수월하리라 생각합니다.\n");
	printf("또한, 인터넷프로그래밍 및 응용 낭종호 교수님 수업을 들으면서 서버 및 API 사용, php, javascript, html, database, 스타일 시트로 css까지 코딩을 하는데에 있어 생각하는 학습능력이 많이 길러졌다는 점에서 다른 학우분들과의 차이점이라 생각합니다.\n");
	printf("강의자료를 한번 다 눈대중으로 읽어보았는데 계절학기가 일정이 빡빡한 점을 제외하고는 아는 내용이 많다고 생각합니다.");
	printf("구조체와 파일시스템, 포인터를 배운다면 도서관리 시스템 정도의 개발을 해볼 수 있지 않을까 생각합니다.\n");

	return 0;
}